app/views/gossip/home.html.erb

SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 10], ["LIMIT", 1]]
---
            <td><%= g.title %></td>
            <td><%= g.user.first_name %></td>