app/views/gossips/index.html.erb

SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 10], ["LIMIT", 1]]
---
                            <%= link_to "/user/#{gosp.user_id}" do %>
                                <%= gosp.user.first_name %>