app/views/gossips/show.html.erb

                            <%= link_to "/user/#{@goss.user_id}" do %>
                                <%= @goss.user.first_name %>
---
SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 4], ["LIMIT", 1]]