app/views/city/show.html.erb

<ol>
    <%@city.users.each do |cu|%>
---
SELECT "users".* FROM "users" WHERE "users"."city_id" = $1  [["city_id", 3]]