app/controllers/gossips_controller.rb

INSERT INTO "cities" ("name", "zip_code", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["name", " Tana"], ["zip_code", " 101"], ["created_at", "2019-10-31 12:06:02.854915"], ["updated_at", "2019-10-31 12:06:02.854915"]]
INSERT INTO "users" ("first_name", "last_name", "description", "email", "age", "city_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8) RETURNING "id"
INSERT INTO "gossips" ("title", "content", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"
---
  def create
    @city = City.new(name: params[:city], zip_code: params[:zip_code])
    @city.save
    @user = User.new(first_name:params[:nom],last_name:params[:prenom],description:params[:description],email:params[:email],age:params[:age],city_id:@city.id)
    @user.save
    @gossips = Gossip.new(title: params[:title], content: params[:content], user_id: @user.id)
    @gossips.save

SELECT "gossips".* FROM "gossips" WHERE "gossips"."id" = $1 LIMIT $2  [["id", 10], ["LIMIT", 1]]
---
  def show
    @goss = Gossip.find_by(id:params["id"])